In [20]:
import pandas as pd

In [21]:
ls

311-service-requests.csv      Problems.docx
311-service-requests.csv.zip  Problems.pdf
AutoSurvey.csv                auto_survey_solutions.ipynb
BreadBasket_DMS.csv           euro2012_stats.ipynb
Euro 2012 stats TEAM.csv*     ~$oblems.docx
Icon?

In [22]:
data=pd.read_csv("AutoSurvey.csv")

In [23]:
data.head()

   Gender       Type Purchased  Vehicle_Age  Mileage   MPG
0    Male   Mid-size      Used          NaN   127233  28.7
1  Female   Mid-size       New          1.0    23970  43.4
2    Male      Small       New          7.0    77392  24.0
3  Female  Large SUV      Used         14.0   185397  15.2
4  Female      Small       New          2.0    26001  37.0

In [24]:
data[data.Vehicle_Age==data.Vehicle_Age.min()]

    Gender      Type Purchased  Vehicle_Age  Mileage   MPG
13  Female  Mid-size       New         0.25     3454  28.3

In [25]:
data.Vehicle_Age.max()-data.Vehicle_Age.min()

13.75

In [26]:
def f(x):
    return x.Vehicle_Age.max()-x.Vehicle_Age.min()

In [27]:
f(data)

13.75

In [38]:
data.groupby("Type").apply([f,"count"]).to_frame()

TypeError: unhashable type: 'list'

In [34]:
def dif(x):
    return x.max() - x.min()

In [35]:
data.groupby("Type")[["Vehicle_Age"]].agg([dif,"count"])

          Vehicle_Age
                  dif count
Type
Large SUV        7.00     2
Mid-size        11.75     4
Minivan          5.00     2
Small           11.00    11
Small SUV       10.00     3

In [36]:
data.groupby("Type")[["Vehicle_Age"]].agg([dif,"size"])

          Vehicle_Age
                  dif size
Type
Large SUV        7.00    2
Mid-size        11.75    5
Minivan          5.00    2
Small           11.00   11
Small SUV       10.00    3

In [31]:
data.query("Type=='Large SUV'")

    Gender       Type Purchased  Vehicle_Age  Mileage   MPG
3   Female  Large SUV      Used         14.0   185397  15.2
14  Female  Large SUV       New          7.0   130905  21.0

In [32]:
data.pivot_table(values="Mileage",index="Type",columns="Purchased")

Purchased            New      Used
Type
Large SUV  130905.000000  185397.0
Mid-size    11424.333333  106810.0
Minivan    180643.000000  182584.0
Small       80405.833333  131022.4
Small SUV   29823.000000  113121.0

In [33]:
data.groupby

<bound method DataFrame.groupby of     Gender       Type Purchased  Vehicle_Age  Mileage   MPG
0     Male   Mid-size      Used          NaN   127233  28.7
1   Female   Mid-size       New         1.00    23970  43.4
2     Male      Small       New         7.00    77392  24.0
3   Female  Large SUV      Used        14.00   185397  15.2
4   Female      Small       New         2.00    26001  37.0
5   Female    Minivan       New         9.00   180643  20.0
6     Male      Small      Used         6.00    72083  45.7
7     Male      Small       New        11.00   165353  42.0
8     Male      Small      Used        13.00   205288  33.0
9   Female      Small       New         7.00   142897  31.0
10    Male    Minivan      Used        14.00   182584  12.0
11    Male  Small SUV      Used        13.00   140479  20.0
12  Female      Small       New         2.00    22114  28.0
13  Female   Mid-size       New         0.25     3454  28.3
14  Female  Large SUV       New         7.00   130905  21.0
15  Female      Small      Used        10.00   105628  35.0
16  Female      Small       New         5.00    48678  30.4
17    Male   Mid-size       New         0.50     6849  40.2
18  Female      Small      Used        10.00   137941  30.0
19  Female  Small SUV       New         4.00    29823  24.9
20    Male  Small SUV      Used        14.00    85763  21.0
21  Female      Small      Used        12.00   134172  31.0
22    Male   Mid-size      Used        12.00    86387  27.0>